day04/01introToFVM/101FVM/shockTube/system/functionObject1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
(

additional_fields_aposteriori
{
    type writeRegisteredObject;
    functionObjectLibs ( "libIOFunctionObjects.so" );
        
    objectNames ("rho");

    enabled           true;
    outputControl     outputTime;
}

);
