day04/01introToFVM/101FVM/shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
( 
    volVectorFieldValue U (0 0 0) 
    volScalarFieldValue T 0.00348 
    volScalarFieldValue p 1 
);

regions         
( 
    boxToCell 
    { 
        box (0.5 -100 -100) (100 100 100) ; 
        fieldValues 
        (
            volScalarFieldValue T 0.00278
            volScalarFieldValue p 0.1
        ); 
     } 
);

// ************************************************************************* //